Notes/Intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Intro</title>
<!-- 2014-09-23 Tue 15:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Abraham Xiao" />
</head>
<body>
<div id="content">
<h1 class="title">Intro</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Prologue: How to Program</a>
<ul>
<li><a href="#sec-1-1">1.1. Foreword</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. How the Second Edition Differs from the First</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Prologue</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prologue: How to Program</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Bad programming is easy. Even Dummies can learn it in 21 days.</i>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Foreword</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> How the Second Edition Differs from the First</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>In particular, this edition focuses on two kinds of programs:
interactive, reactive (graphical) programs and so-called batch
programs.
</li>
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Prologue</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>What the book is not about Many early books on programming and
even some of today’s books teach you a lot about the authors’
favorite application discipline for programming: mathematics,
physics, music, accounting, and so on. To some extent that is
natural, because programming is useful in those areas. Then
again, it forces you to know a lot (or at least something) about
those disciplines. This book really focuses on programming and
problem solving and what computer science can teach you in this
regard. We have made every attempt to minimize the use of
knowledge from other areas; for those few occasions when we went
too far, we apologize.
</li>
<li>Let’s summarize again. To program is to write down an arithmetic
expression, but you’re no longer restricted to boring numbers.
</li>
<li>Indeed, programs are functions, and once you understand functions
well, you know almost everything there is about programming.
</li>
<li><code>(define (FunctionName InputName) BodyExpression)</code>
</li>
<li>You can launch a function by hand on a few select inputs to
ensure it produces the proper outputs. This is called testing a
function.
</li>
<li>In the ideal program, a small request, such as changing the sizes
of the canvas, should require an equally small change.
</li>
<li>In modern parlance, you have just experienced your first program
refactoring. Every time you re-organize your program to prepare
yourself for likely future change requests, you refactor your
program.
</li>
<li>As you read on, keep in mind that real programs consists of
50,000 or 500,000 or 5,000,000 lines of code.
</li>
<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abraham Xiao</p>
<p class="date">Created: 2014-09-23 Tue 15:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
